{
  "storytelling": {
    "greetings" :  [ "Dark clouds gather as you step in front of the forgotten dungeon gate.",
      "A demonic laugh fades into the wind as you reach the rusty gate of the cursed castle.",
      "The forest abruptly parts, revealing the gaping mouth of a crypt covered in forgotten runes.",
      "You finally arrive before the abandoned bunker, a relic of forbidden experiments.",
      "A supernatural mist greets you at the foot of the obsidian tower.",
      "Crows scatter at your approach: the mad king’s fortress lies ahead.",
      "The dimensional gate pulses with energy as you step onto planet Xarak-9.",
      "The old manor creaks a silent warning as you cross into the Von Kröhl estate.",
      "The legends were true: the underground labyrinth is real. And you're at its door.",
      "The ground quakes slightly as the runic door lights up at your approach.",
      "The tower leans, defying physics, but you know the truth lies at its summit.",
      "The silence is deafening. Before you, the entrance to the Temple of a Thousand Deaths watches you.",
      "A hand-written sign reads ‘Flee, you fool!’. Too late – you're already at the crypt.",
      "Rain pours over your armor as you reach the threshold of the shadowed castle.",
      "The jungle parts, unveiling an ancient stairway into the earth’s depths.",
      "The wind howls like a warning. Before you: the Cathedral of the Void.",
      "A robotic voice announces: ‘Access to level 13 – restricted to sentient entities.’ You're in the right place.",
      "The elevator halts with a jerk. Rusted doors. Dark hallway. The lab awaits.",
      "Even the GPS seems afraid: ‘Uncharted territory.’ Perfect. You're here.",
      "An endless chasm lies ahead, spanned by a single chain bridge to the lost bastion.",
      "Inhuman screams echo from within, but your mission is clear: enter the living dungeon.",
      "Millennia-old dust rises as you walk between the columns of a forgotten temple.",
      "There, before you, a simple wooden cabin. Too simple. Far too simple.",
      "The force field crackles, revealing a breach in the alien complex wall.",
      "An owl stares at you, then flies off, revealing a hidden path under an ancient oak root.",
      "The stone statues seem to follow your every move as you near the forbidden portal.",
      "You survived the map, the guide, and the traitor. In front of you: the Puzzle Gate.",
      "Drones patrol the skies. You’ll have to be fast to get into the orbital citadel.",
      "A voice in the shadows whispers: ‘You came... too late? Or just in time?’",
      "A lullaby echoes from the castle. But you know no one has lived there for 300 years.",
      "At last, your eyes rest on the inverted pyramid. The Guardian must still be inside.",
      "Snow falls silently. Before you: the steel gate of an old nuclear silo.",
      "You extend your hand. The wall of light opens. Behind it, a forbidden techno-magic sanctuary.",
      "The smell of blood, ash, and rust: the Iron Dungeon is near.",
      "All the town's clocks have stopped. And you’re opening the door to the cursed belfry.",
      "The ancient mirror led you here. Through it, you see the mausoleum emerge.",
      "Your footsteps echo on metal. An abandoned orbital station, finally within reach.",
      "The dragon’s shadow passes over you. Its lair is close.",
      "Light doesn’t reach this cave. But you know this is where it all began… and where it will end." ],

    "ambiance": [
      "You step into the corridor, and the echo of your footsteps seems to multiply around you.",
      "A cold breeze brushes your neck—there’s no wind, and you are very much underground.",
      "You push open a heavy door—it groans loudly, echoing like a complaint.",
      "The torchlight flickers as you descend a spiral staircase carved into the stone.",
      "Somewhere in the distance, you hear dripping water. And something else.",
      "You squeeze through a narrow passage, the stone walls damp and uncomfortably close.",
      "Dust hangs in the air, thick and undisturbed for ages... until now.",
      "You pass under a crumbling archway, barely holding itself together.",
      "Something scurries past your foot. You choose not to look.",
      "You step into a room where every sound you make seems swallowed by the darkness.",
      "A soft glow pulses from the wall ahead—faint, rhythmic, almost like breathing.",
      "You follow a trail of ancient symbols etched into the ground.",
      "The air smells of mold, metal, and secrets.",
      "You step onto a tiled floor—one tile sinks with a click.",
      "A strange humming sound fills your ears. No one else seems to hear it.",
      "You feel like you’ve been in this corridor before. But haven’t you been going straight?",
      "A distant scream echoes. Human? Not human? Better not to know.",
      "You feel watched. Not by eyes—but by the walls themselves.",
      "Your torch dims for a moment. The darkness feels… alive.",
      "The silence here is so thick it presses against your skin."
    ],
    "chest_discovery": [
      "You spot a chest in the corner—its lid slightly ajar, as if it’s been opened recently.",
      "Covered in cobwebs and sealed with a rusted lock, the old crate practically dares you to open it.",
      "A small, ornate box sits on a pedestal, glowing faintly with an eerie blue light.",
      "You find a treasure chest... sitting on top of a pressure plate. Classic.",
      "The crate looks ordinary—until it blinks at you.",
      "You open the box, and a puff of glittery smoke bursts out, smelling oddly like cinnamon.",
      "The chest groans as you pry it open, as if reluctant to reveal its secrets.",
      "There’s a note pinned to the lid: “Definitely not cursed.”",
      "A heavy, ironbound chest rests in the center of the room, untouched by dust. Suspiciously untouched.",
      "You reach for the lid, but the chest suddenly scuttles three steps back.",
      "Inside the wooden crate, you find... another smaller crate. Neatly labeled “Important.”",
      "The chest opens with a dramatic creak, revealing a single sock. It’s glowing.",
      "The box is locked tight, but you notice fresh scratches around the keyhole. Someone else tried.",
      "You lift the lid, and dozens of eyes blink up at you. Then vanish.",
      "As soon as you open the chest, a loud trumpet sound plays from nowhere. Dramatic much?",
      "You brush the dust off a metal coffer—engraved with runes that rearrange themselves when touched.",
      "It’s not locked, but something about the silence around the chest makes you hesitate.",
      "You find a small chest tucked under a pile of bones. The bones weren’t human. Probably.",
      "You open the lid and find... your own name carved inside.",
      "The chest is empty—but you definitely saw something move inside before you opened it.",
      "A beam of light suddenly illuminates a square shape in the dust: a forgotten chest awaits you.",
    "You push aside the vines and uncover an ancient box sealed with rusty chains.",
    "Beneath the cracked tiles, you notice a trapdoor hiding a small chest covered in symbols.",
    "By pushing a secret wall, you discover an altar upon which rests a dusty case.",
    "A mechanism clicks dryly: a compartment slowly opens, revealing a strange box.",
    "At the bottom of a dried-up pond, you spot an engraved crate poking through cracked sand.",
    "A tattered rug concealed a trunk embedded in the ground.",
    "Your torch flickers... and in the shadows, a sealed cabinet catches your eye.",
    "A tilting stele reveals a dusty cache holding a small stone chest.",
    "In the ribcage of a giant’s skeleton, a chest lies intact despite the centuries.",
    "You open the sculpted mouth of a statue and find a rune-covered box inside.",
    "A slab gives way under your step, revealing a secret cache with a copper-bound chest.",
    "The wind lifts the cloth of an old war tent. Beneath it, a time-darkened wooden crate.",
    "Dust swirls as you pull aside the curtain of a forgotten tomb, revealing a chest.",
    "A moonbeam slips through a crack in the ceiling and lights up a chest buried under rubble.",
    "You notice a suspicious bump in the freshly turned earth. Digging reveals a box.",
    "A hidden drawer in an old piece of furniture unveils a carefully locked case.",
    "You hear a click as your hand brushes the wall: a cache opens slowly.",
    "A collapsed altar reveals a stone cavity holding a symbol-covered chest.",
    "As you approach the well, you hear a metallic echo. A box hangs at the bottom on a chain.",
    "At the bottom of a mummified traveler’s bag, you find a metal box engraved with ancient marks.",
    "A slab slips beneath your hand. Inside, a fragrant wooden box, intact.",
    "Breaking through a crumbly wall, a hollow space reveals a chest sealed with silver nails.",
    "You find a chest wedged between two charred beams of a forgotten attic.",
    "Fireflies scatter as you open the stone door, revealing a moss-covered box.",
    "A chest balances precariously on a pillar at the center of a chasm, calling to you.",
    "An ancient book hid a recess holding a yellowed ivory case.",
    "A large trunk rests at the exact center of a carved circle on the floor.",
    "The fountain suddenly runs dry, revealing a box embedded in its basin.",
    "Pulling a hidden lever, a wall section rotates, exposing a dusty box.",
    "An old clock stops, its pendulum revealing a compartment with a small chest.",
    "A carved tablet crashes to the floor, splitting cleanly to reveal a box in the stone.",
    "The ground cracks beneath your foot, and within the fissure, a metallic glint catches your eye.",
    "A curtain of vines hides the entrance to a natural alcove with a sealed chest inside.",
    "You open a booby-trapped drawer and find a box with an unbroken lock.",
    "A bell tolls in the distance, and in the deserted sacristy, a chest awaits you in silence.",
    "You lift an old, worn rug: a wooden trapdoor reveals a neatly stored trunk.",
    "A crumbling altar hides a box held in place by ancient blackened chains.",
    "A simple wooden box rests on a cushion at the center of a flawless circle of salt.",
    "A slab slowly rises beneath your hand: a final breath of magic still protects the box within."
    ],
    "eny_meeting": [
      "You feel eyes on you, but when you turn, there's nothing but shadows.",
      "A low, wet sound echoes through the corridor... and it’s getting closer.",
      "You freeze mid-step—the silence around you is suddenly *too* complete.",
      "Something shifts just beyond the range of your torchlight.",
      "You hear a slow dragging noise from behind the wall... then silence.",
      "A shadow detaches itself from the corner and moves—against the light.",
      "There’s a faint breathing sound up ahead. It stops the moment you notice it.",
      "Your foot nudges something soft on the floor. It twitches.",
      "You spot fresh footprints in the dust—*very* fresh.",
      "The hairs on the back of your neck rise as you step into the chamber. You’re not alone.",
      "You hear a single metallic clink. Then another. Then... nothing.",
      "The air here is warmer. And it smells... wrong.",
      "You swear you saw something at the end of the hall—but now it’s gone.",
      "A distant hiss slithers through the silence, just low enough to doubt if it was real.",
      "Your torch flickers twice—on the third flicker, something stands where nothing was before.",
      "You round a corner and come face to face with— *nothing*. But the dread in your gut says otherwise.",
      "A deep growl reverberates from the walls. Or was it the ceiling?",
      "A whisper brushes past your ear, though no one is there. It said... your name.",
      "The floor ahead is scorched. Still warm.",
      "You blink, and when your vision clears, the room has changed. And you’re not alone anymore.",
       "A distant thud echoes. Something is approaching… and it’s not human.", "The air grows heavier. A presence watches you from the shadows.", "Your instincts tighten. You are no longer alone in this room.", "A shadow shifts, just at the edge of your vision.", "A raspy breath cuts the silence. It’s close.", "The floor trembles slightly… something stirs in the dark.", "Your heart races. There’s something else here, waiting.", "A warped moan rises, chilling your spine.", "A door slams behind you. Ahead, something slowly stirs.", "A sudden chill creeps in. As if a presence has just arrived.", "The ambient noise dies too perfectly. That’s never good.", "Your footsteps echo... but another rhythm joins in.", "Your torch flickers. Something is disturbing it.", "You hear a muffled growl. It’s coming from down the corridor.", "A foul stench hits you. Something is close.", "Your hand brushes a wall... and something brushes back.", "You hear claws scraping stone. Slowly. Deliberately.", "A hot breath grazes your neck. You didn’t see it coming.", "The light vanishes, as if devoured. And a whisper calls your name.", "Something surrounds you—unseen, but undeniably there.", "The ceiling creaks. It might be right above you.", "You feel a pulse. Deep, rhythmic. Getting closer.", "A scream—brief, muffled. Then silence. You know you’re next.", "The wind whispers your name. But there’s no wind here.", "A chain rattles softly. It’s not alone.", "You stumble over a bone. It’s still warm.", "Something darts away... then circles back.", "A dry, grating laugh splits the quiet.", "You think you see a shape. Then two. Then nothing.", "The door closes on its own. A breath echoes in the dark.", "Your vision blurs. Something is pushing into your mind.", "The space around you warps. A foreign will is watching.", "You open a chest... but it’s not a chest.", "A tear escapes. You don’t know why.", "You speak a forbidden word. Something answers.", "A mirror shatters. Your reflection doesn’t move.", "An ancient cold crawls under your skin. It saw you.", "A low howl rises from beneath the floor.", "Your lamp casts no shadows. Everything is alive.", "A whisper speaks... in a language you shouldn’t understand, but do."
    ],
    "safe_room": [
      "You push open the door, and warm light spills out, golden and gentle.",
      "The scent of herbs and old wood welcomes you like an old friend.",
      "Soft moss carpets the floor, and a small spring bubbles quietly in the center of the room.",
      "You find a quiet chamber where time seems to slow down, just a little.",
      "Candles glow on the walls, their flames undisturbed by any breeze.",
      "A table stands set with bread and fruit—fresh, untouched, and oddly inviting.",
      "The air is warm, the silence soft. Even your wounds seem to ache a little less here.",
      "An old fireplace crackles in the corner, though there's no sign of who lit it.",
      "You step into the room and exhale. You hadn't realized how tense you'd been.",
      "A soft lullaby seems to hum from the stones themselves.",
      "You find a hammock gently swaying, as if it’s been waiting for someone.",
      "There’s a kettle resting over a fire. It begins to whistle just as you arrive.",
      "The walls are carved with peaceful scenes—forests, stars, a sleeping dragon.",
      "You sit, and for the first time in what feels like days, nothing tries to kill you.",
      "A faint, familiar melody plays somewhere in the room—one from your childhood, maybe?",
      "You step into the chamber, and for a brief moment, it feels like home.",
      "The room smells like lavender and old parchment. It feels safe.",
      "A stack of thick, cozy blankets rests in the corner. They look absurdly clean.",
      "You hear soft snoring. A friendly-looking cat naps on a pile of pillows.",
      "There’s a handwritten note on the wall: “Rest here, brave traveler. You’ve earned it.”"
    ],
    "magic_place": [
      "A soft light glows from the center of the room, where a crystal hovers inches above an ancient pedestal.",
      "You hear the gentle trickle of water, and step into a chamber where a luminous fountain flows upward.",
      "The air hums faintly, vibrating with power you can feel in your bones.",
      "A circle of runes surrounds a small pool of silver liquid—its surface perfectly still.",
      "A floating orb spins slowly in the air, casting rainbow-colored reflections on the walls.",
      "The moment you enter, the room reacts—glyphs ignite across the floor in a slow, pulsing rhythm.",
      "You discover an altar covered in vines that bloom with glowing flowers as you approach.",
      "A mirror stands alone in the room, but your reflection smiles before you do.",
      "You reach a chamber bathed in twilight, though no sun could possibly shine here.",
      "In the center of the room, a sword floats, point down, embedded in nothing at all.",
      "The fountain’s waters glow with a soft green light, and the scent of spring fills the air.",
      "A spiral staircase leads nowhere—until you step onto it, and it begins to move.",
      "As you approach the pool, glowing fish dart through the air above it like birds.",
      "The room is filled with books that turn their own pages slowly, as if browsing themselves.",
      "You touch the stone wall, and it sings softly in a language you almost understand.",
      "A beam of light shines down from nowhere, illuminating a chalice that seems untouched by time.",
      "The air is thick with sparkles, and when you inhale, you briefly remember a dream you once forgot.",
      "A set of footprints—glowing faintly—lead across the room, and vanish into the wall.",
      "At the center lies a giant egg, cracked open. Whatever was inside left behind a trail of stardust.",
      "You blink, and the entire room shifts color—from deep blue to vibrant gold—as if reacting to your presence."
    ],
    "char_names": [
      "Thalwen",
      "Marjorielle",
      "Drevik",
      "Nimaé",
      "Corvinus",
      "Liora",
      "Fenric",
      "Ysilde",
      "Brambletuck",
      "Kaelen",
      "Odra the Quiet",
      "Sir Pindleworth",
      "Ériska",
      "Jorran",
      "Velka",
      "Maelis of the Dusk",
      "Tarnik",
      "Belladora",
      "Rooke",
      "Nemri",
      "Azgarn",
      "Fiolla",
      "Wendilynn",
      "Quorran",
      "Ephraim the Slightly Lost",
      "Zaliara",
      "Grimble",
      "Ansel of Greenmere",
      "Nehari",
      "Torvik Ashhand"
    ],
    "char_adjectives": [
      "Sleepy",
      "Bloody",
      "Mysterious",
      "Sulky",
      "Radiant",
      "Slimy",
      "Cursed",
      "Chatty",
      "Hungry",
      "Enraged",
      "Grumpy",
      "Shadowed",
      "Proud",
      "Damp",
      "Shimmering",
      "Rusty",
      "Toothless",
      "Wailing",
      "Elegant",
      "Giggly",
      "Rotten",
      "Burning",
      "Polite",
      "Ashen",
      "Sticky",
      "Mourning",
      "Sneaky",
      "Draconic",
      "Twinkling",
      "Wrinkled",
      "Slumbering",
      "Sour",
      "Gleeful",
      "Venomous",
      "Ragged",
      "Unblinking",
      "Sizzling",
      "Confused",
      "Hollow",
      "Wicked",
      "Blubbering",
      "Shy",
      "Grinning",
      "Withered",
      "Ancient",
      "Yawning",
      "Echoing",
      "Frail",
      "Melancholy",
      "Spiky"
    ],
    "equipable_items": [
      "Helmet",
      "Cloak",
      "Bracelet",
      "Gloves",
      "Boots",
      "Goggles",
      "Shoulder pads",
      "Amulet",
      "Ring",
      "Belt",
      "Scarf",
      "Monocle",
      "Tunic",
      "Leggings",
      "Pauldrons",
      "Hood",
      "Mask",
      "Cape",
      "Corset",
      "Bracers",
      "Greaves",
      "Gauntlet",
      "Necklace",
      "Slippers",
      "Backpack",
      "Vest",
      "Tiara",
      "Earrings",
      "Shawl",
      "Bandana"
    ],
    "item_adjectives": [
      "Moldy",
      "Enchanted",
      "Fluffy",
      "Cursed",
      "Glittering",
      "Damp",
      "Legendary",
      "Sticky",
      "Shimmering",
      "Torn",
      "Screaming",
      "Rusted",
      "Celestial",
      "Feathered",
      "Glowing",
      "Soggy",
      "Vampiric",
      "Itchy",
      "Regal",
      "Prehistoric",
      "Invisible",
      "Paper-thin",
      "Obsidian",
      "Squeaky",
      "Ancient",
      "Smelly",
      "Lava-forged",
      "Haunted",
      "Cracked",
      "Whispering"
    ],
    "eny_random_type": [
      "Weak gobelin",
      "Spider",
      "Toothless cat",
      "Starving dog",
      "Frog",
      "Boneless skeleton"
    ]
  },


  "items_dict": {
    "AntiStatus.use.ok": "You're not suffering {self.attribut} anymore.",
    "AntiStatus.use.no": "It does nothing because you aren't suffering {self.attribut}.",
    "AntiStatus.__str__": "anti-",
    "BuffingItem.__str__": "buff",
    "BuffingItem.use" : "Now you feel stronger, and your foes are trembling with terror...",
    "Wearable.worn": "Worn",
    "Wearable.notworn": "Not worn",
    "Items.__str__": "{self.name} : {self.hp} hp / {self.mana} mana / {self.att} attack / {self.df} defense.",
    "Eatable.name_hppot": "Health potion",
    "Eatable.name_hppota": "Adaptive Health potion",
    "Eatable.name_manapot": "Mana potion",
    "Eatable.name_manapota": "Adaptive Mana potion",
    "Eatable.name_bandc": "Bread and cheese"
  },
  "characters_dict" : {
    "character.cure_status" : "{name} is not touching you anymore.",
    "character.impact_status" : "You are touched by {status.name}. It applies {value} {effect}.",
  "attack_target.failed": "{self.name} attacks and... Failed. {enemy.name} is laughing.",
  "attack_target.atk": "{self.name} attacked and dealt {dmg} damage.",
  "lvl_up.no": "You have {self.exp}/{xp_to_lvl} exp to level {self.lvl + 1}.",
  "lvl_up.yes": "Congratulations, you leveled up to level : {self.lvl} ! You're stronger now (+ {ahp} hp, + {amana} mana, + {aatt} attack, + {adf} defense).",
  "player.special_attack": "It seems you do not have any special attack. You just attack the enemy. ",
  "player.myturn": [
    "Attack",
    "Special capacity : {self.special[0]} (cost {self.special[1]} mana)",
    "Use an item from your inventory"
  ],
  "player.use_item": "You use {item.name}.",
  "player.equip_wearable": "You've equiped {item.name}.",
    "player.unequip_wearable" : "You've unequiped {item.name}.",
    "player.change_wearable.no" : "You didn't swap any equipment.",
  "Baker.definition": "Baker : player who has more hp and attack. Special attack (cost 5 mana) : divides by 2 the ennemy attack, and if you have luck, divides the defense too.",
  "Baker.class" : "Baker",
    "Baker.special": "Strong gluten",
  "AnyClass.special_attack.invoke": "You invoke {self.special[0]}.\n",
  "AnyClass.special_attack.nomana": "Not enough mana. That's sad, you've lost time so it's your enemy's turn...",
  "Baker.special_attack.critical": "Critical hit ! Enemy attack and defense are divided by 2.",
  "Baker.special_attack.ok": "Enemy attack is divided by 2.",
  "NarcissicPerverse.definition": "Narcissic perverse : player who has more mana. Special attack (5) : deals some damages to enemy and heal of half.",
  "NarcissicPerverse.class" : "Narcissic perverse",
    "NarcissicPerverse.special": "Guiltifying",
  "NarcissicPerverse.special_attack.ok": "{enemy.name} enemy lost {dmg} {hp} while you healed by {int(dmg/2)}.",
  "Gambler.definition": "Gambler : player who has a better luck. Special attack (3) : if 6 or higher, inflicts half of the enemy max hp damages.",
  "Gambler.class" : "Gambler",
    "Gambler.special": "Spring rolls",
  "Gambler.special_attack.no": "{de}... Nice try but it does nothing.",
  "Gambler.special_attack.yes": "{de} ! {enemy.name} suffers {dmg} damages.",
  "Gambler.special_attack.atk": "{enemy.name} also lost {atk} attack.",
  "Gambler.special_attack.df": "{enemy.name} also lost {df} defense.",
  "Gambler.special_attack.atkdf": "{enemy.name} also lost {atk} attack and {df} defense.",
  "Gambler.lvl_up": "You also increase your luck by 1."
},
"eny_dict" : {
  "Eny.definition": "just a ",
  "Eny.__str__.strengh": "Strengh",
  "EnyOldMan.common_name": "Old man",
  "EnyOldMan.definition": "An old man bothered by your presence. He sometimes forgot things.",
  "EnyOldMan.myturn": "{self.name} forgot of your presence and does nothing.",
  "EnyRageDog.common_name": "Rage dog",
  "EnyRageDog.definition": "A strange dog with white slobber. It can attack twice, be carefull.",
  "EnyRageDog.myturn": "{self.name} bites again !",
  "EnyElementaryBug.common_name" : "Elementary bug",
  "EnyElementaryBug.definition" : "An anoying bug that applies malus depending of its element. Carefull, it's not that simple to kill.",
  "EnyElementaryBug.still_alive" : "You thought that it was scratched. But its still moving !",
  "EnyElementaryBug.myturn" : "{self.name} stung you and applied {self.malus[0]}.",
  "element_list" : ["Toxic","Clever", "Blazing","Electric", "Bright", "Cursed"]
},
"display_dict" : {
  "wait_for_input.zero": "0 to go back.\n--> ",
  "display_player_turn.turn": "YOUR TURN",
  "display_eny_turn.turn": "ENEMY TURN"
},
"rpg_exceptions_dict" : {
  "LoadingError.__str__": "We were unable to load your file. You'll start a new game.",
  "NoSavedGame.__str__": "No saved game in the save/ directory. You'll start a new game.",
  "ItemNotFound.__str__": "You do not have this item in your inventory.",
  "ToMuchWearable.__str__": "You can only wear 5 items at one time, please unequip something before.",
  "DeadCharacter.__str__.player": "Sorry, you died. Heroically, but still... You're dead.",
  "DeadCharacter.__str__.eny": "{self.dead.name} enemy died. You won."
},
"events_dict" : {
  "eny_encounter": "{story} \nIt's {eny.name}! \nIt can be defined by : {eny.definition} You have to fight for your life !",
  "eny_generator.msg_elite": "An elite warrior stands in your way!",
  "eny_generator.msg_boss": "⚠️ A terrifying boss emerges from the shadows...",
  "chest.list_choices": [
    "Well... I prefer to let it alone",
    "Of course I open it !"
  ],
  "chest.no": "You go ahead in the dungeon without touching the chest.",
  "chest.try": "You try to open it...\n",
  "chest.trap": "It was trapped. You lose {ply.take_damage(hp)} {hp.full}.",
  "chest.empty": "The chest is empty...",
  "chest.inside_1": "{it.name} was in the chest. It's now in your inventory",
  "chest.inside_2": "Lucky day ! The chest was full of objects ! You found {it.name} and {it1.name} !",
  "fire_camp.nap": "\nDo you want to take a nap ?",
  "fire_camp.list_choices": [
    "Why not, this place looks good !",
    "Never ! I'm not a child.",
    "I prefer to save the game !",
    "I'd like to check my inventory."
  ],
  "fire_camp.no": "Ok ok, no need to shout out... So, you can continue.",
  "fire_camp.rest": "You rested sucessfully. You feel better : {ply.hp}/{ply.maxhp} hp, {ply.mana}/{ply.maxma} mana.",
  "fire_camp.save": "Game successfully saved. You can continue !",
  "fire_camp.error": "Sorry smt went wrong. For now, no specific error management has been done, because I don't know what to expect.\nThis error is : {e}.",
  "fire_camp.wrong": "It seems something went wrong, so you just continue your adventure in the dungeon.",
  "place_generator.place" : ["Blessing lamp", "Healing waterfall","Cursed smoke"],
  "place_generator.blessing" : "It was a {name}. It gives you the buff {stat.name} for {duration} turns.",
  "place_generator.wrong" : "Something went wrong in",
  "place_generator.cursed" : "You caught loudly. After regaining your senses, you feel worse than ever. All your malus will affect you longer than expected.",
  "place_generator.healing" : "You feel well better, as if an unknown magic cured all the malus you were suffering.",
  "magic_places.choices" : ["I want to look closer", "I prefer to stay away from this place"],
  "magic_places.no" : "You turn on your heels and put as much distance as possible between this place and you."
},
"engine_dict" : {
  "openning.message": "Welcome to the wonderful game RPG battle patata. You will explore an infinite dungeon full of dangers.\nDo you want to load a game, or start a new one ?",
  "openning.list_choices": [
    "Start a new game",
    "Load a game from save directory",
    "Load a game from a custom path (please provide full path with the .json exention)"
  ],
  "openning.savedgame": "Here are the saved games available. Please chose one to load.",
  "openning.loadfile": "Enter you save absolute path (including C:// and .json extension) : \n-->  ",
  "chose_player.name": "What is your name ?\n-->  ",
  "chose_player.player": "\nHello {name}. What kind of player are you ?\n",
  "load_game.exception": "Sorry something went wrong. For now, no specific error management has been done, because I don't know what to expect.\nThis error is : {e}."
},

"main_dict" : {
  "start_game.welcome": "Welcome to our dungeon, {player.name}, proud {player.__class__.__name__}!",
  "start_game.end": "This is the end of the game. We hope you had fun."
},
"status_dict" : {
  "status.malus.poison": "poison",
  "status.item.poison": "antidote",
  "status.malus.stupidity": "stupidity",
  "status.item.stupidity": "mind-swipper",
  "status.malus.burn": "burn",
  "status.item.burn": "water",
  "status.malus.paralized": "paralized",
  "status.item.paralized": "shaker",
  "status.malus.blind": "blind",
  "status.item.blind": "eyes",
  "status.malus.black-cat": "black-cat",
  "status.item.black-cat": "white-paint",
  "status.strengh.slight" : "slight",
  "status.strengh.serious" : "serious",
  "status.bonus.cuckold" : "cuckold",
  "status.item.cuckold" : "lottery winner's ticket",
  "status.bonus.love" : "in love",
  "status.item.love" : "love potion",
  "status.bonus.anger" : "anger",
  "status.item.anger" : "red capa",
  "status.bonus.stone" : "rock abs",
  "status.item.stone" : "fitness center season ticket",
  "status.bonus.wikipedia" : "Mr. Wikipedia",
  "status.item.wikipedia" : "WiFi connexion"
},
  "webapp_dict" : {
    "char_selection.who" : "Proud explorer - or maybe crazy - who are you?",
    "char_selection.chose_class" : "What kind of people are you ?",
    "char_selection.name" : "What's your name ?",
    "char_selection.start" : "Start exploring !",
    "resolve_chest_event.open" : "Do you want to open it ?",
    "base.about" : "About",
    "base.close" : "Quit",
    "index.startgame" : "Go to battle !!!",
    "inventory.inventory" : "Inventory",
    "game.lvl" : "of level",
    "game.attack" : "Attack",
    "game.special" : "Special capacity",
    "game.enemy_turn" : "The enemy attacks !",
    "game.continue" : "Continue to explore the dungeon",
    "game.dead" : "I want to try again !",
    "chest.open" : "Of course I open it !",
    "chest.no" : "Well... I prefer to go away.",
    "equipment.inventory" : "In inventory",
    "equipment.equipment" : "Equipment",
    "equipment.equipment.equip" : "Equip",
    "equipment.equipment.unequip" : "Unequip",
    "equipment.worn" : "Worn",
    "equipment.worn.max" : "You can only wear 5 items at a time. Unequip something if you want to wear one of those items :",
    "index.greetings" : "You open your eyes in a misty clearing, deep within a world you don't recognize.\nStrange whispers surround you, shadows move between the trees, and the air feels heavy with magic and danger.\nThey say this land, once thriving, is now ruled by fallen heroes, wild beasts… and furious patatas.\nYour goal? Survive. Fight. Grow stronger with each battle.\nAnd maybe, one day, find out why you, of all people, were summoned here.\nBut for now, there’s no time for questions.\nYou need a body, a name, and a class. Get ready, adventurer. The story begins now."
  },
  "about_dict" : {
    "about.introduction": "The idea behind this project was simply to help me learn programming while having fun.\nIt doesn’t pretend to be anything more than a student project (self-taught, but still a student).",
    "about.story": "It all started at the end of March 2025, when I wanted to practice object-oriented programming, which I didn't see the point of at the time (I’ve since changed my mind quite a bit). \nSo I began by developing a small command-line RPG (using the Windows console, that little black window with white text) where a player could endlessly fight an enemy.\nEach time I reached a stage I felt was really satisfying (no bugs, and the outcome matched exactly what I WANTED to do—which isn’t always the case...), I showed my code to my slightly annoying colleague. You know, the one who’s never there but shows up at the end of the project with some unbearable line like 'I wouldn’t have done it that way' or 'Why didn’t you do it like this?' or even 'It’s good BUT...'. Well, that colleague was perfectly embodied by ChatGPT.\nSo, every time I was proud of something amazing I had made, I was challenged by those damn artificial neurons, offering several improvements I could make.\n",
    "about.learn": "Along the way, I learned how to:\n- develop a command-line roguelike RPG (object-oriented programming)\n- ask the user for input (input handling and data validation)\n- generate random events (random logic and event tables)\n- earn and use items (OOP and headaches with imports)\n- save and load player progress (external file handling)\n- modularize code and create a Python package\n- discover GitHub and open-source sharing\n- improve modularity by separating display from game engine\n- add multilingual support (thanks to the previous point)\n- implement useful debugging (unit testing)\n...\n\nBy the end of April, I was super happy with the result of my awesome little command-line game.\nBut let’s be honest: no one was that excited to test it and ‘have fun’, because it looked awful and was a pain to run. (no one wants to download a GitHub repo, install dependencies, open the Windows console, type commands, and then play an ugly, crappy game in that same console)\n\nSo I also had to learn to:\n- build a web app (running on a local server)\n- make sure the web app and command-line app were compatible (I wanted both to work, and not for one to break the other)\n- deploy a web app on a server so it could be accessed online\nand here we are.",
    "about.ia": "/!\\ I used AI (ChatGPT) a lot for this project: as an annoying colleague (‘you should/could do this’), as a debugging buddy, but also:\n- to generate ambient lines (for places, enemies...), names, adjectives—in short, most of the displayed text\n- to translate all of it between English, French, and Spanish\n- to generate the few images in the project",
    "about.bugs": "- if you try changing the language during a fight against the elemental cockroach, it’ll crash. I think it’s because maluses are based on their name, and when you switch languages, the existing malus name doesn’t get updated, so the app tries to find a malus in French when it was applied in English, for example. I’ve been too LAZY to fix it so far.\n- the French text is a mess: it mixes formal and informal tone randomly—even in the same sentence. The original was in English, so no problem there, but I ran the translation through AI without reviewing it, and well… yeah (lazy again)\n- gender in French isn’t always respected (lazy)\n- item and monster names are sometimes weird because the adjective and noun are swapped. The random name generator was designed for English text (lazy)\n- these same issues probably exist in Spanish, but I don’t speak Spanish, so I can’t spot them (lazy)",
    "about.roadmap": "Even though I often tell myself there’s no point in trying to make a fully playable and complex game, I still have a bunch of ideas:\n- create a leaderboard to have some kind of player competition (requires deploying and managing a database)\n- add a contact form for feedback or bug reporting (database again)\n- make the site responsive so it looks good on all screens (phone/tablet/PC)\n- just add more content (playable characters, enemies, attacks/spells)\n- maybe even build a kind of dungeon map and allow movement between rooms\n- basically, the possibilities are endless—but limited by time and especially LAZINESS",
    "about.github": "You can find all the code used (backend and frontend) on my GitHub page:\n",
    "about.learn.title": "Skills Developed",
    "about.ia.title": "Use of AI",
    "about.bugs.title": "Known Bugs",
    "about.roadmap.title": "What’s Next?",
    "about.github.title": "GitHub",
    "about.story.title": "Project development, storytelling and random blah(s)(s)(s)"
  },

  "stats_dict" : {
    "hp" : "HP",
    "mana" : "MANA",
    "att" : "ATT",
    "df" : "DEF",
    "luck" : "LUCK",
    "maxhp" : "max HP",
    "maxma" : "max MANA",
    "hp.full" : "health points",
    "mana.full" : "mana points",
    "att.full" : "attack",
    "df.full" : "defence",
    "luck.full" : "luck",
    "maxhp.full" : "maximum health points",
    "maxma.full" : "maximum mana points"
  }
}