{
  "storytelling": {
    "ambiance": [
  "Entras en el pasillo, y el eco de tus pasos parece multiplicarse a tu alrededor.",
  "Una brisa fría roza tu cuello—no hay viento, y estás claramente bajo tierra.",
  "Empujas una puerta pesada—gime ruidosamente, como una queja.",
  "La luz de la antorcha parpadea mientras desciendes una escalera de caracol tallada en la piedra.",
  "A lo lejos, escuchas goteo de agua. Y algo más.",
  "Te aprietas por un pasaje estrecho, las paredes de piedra húmedas e incómodamente cercanas.",
  "El polvo flota en el aire, espeso e inalterado durante siglos... hasta ahora.",
  "Pasas bajo un arco derrumbado, que apenas se sostiene.",
  "Algo corre junto a tu pie. Prefieres no mirar.",
  "Entras en una sala donde cada sonido que haces parece ser tragado por la oscuridad.",
  "Un resplandor suave pulsa desde la pared frente a ti—débil, rítmico, casi como una respiración.",
  "Sigues un rastro de símbolos antiguos grabados en el suelo.",
  "El aire huele a moho, metal y secretos.",
  "Pisas un suelo de baldosas—una de ellas se hunde con un clic.",
  "Un extraño zumbido llena tus oídos. Nadie más parece oírlo.",
  "Sientes que ya has estado en este pasillo. ¿Pero no ibas en línea recta?",
  "Un grito distante resuena. ¿Humano? ¿No humano? Mejor no saberlo.",
  "Sientes que te observan. No con ojos—sino con las propias paredes.",
  "Tu antorcha se atenúa por un momento. La oscuridad parece... viva.",
  "El silencio aquí es tan denso que presiona contra tu piel."
],
    "chest_discovery": [
  "Ves un cofre en la esquina—su tapa ligeramente entreabierta, como si se hubiera abierto recientemente.",
  "Cubierta de telarañas y sellada con un candado oxidado, la vieja caja prácticamente te desafía a abrirla.",
  "Una pequeña caja ornamentada se encuentra sobre un pedestal, brillando tenuemente con una luz azul inquietante.",
  "Encuentras un cofre del tesoro... colocado sobre una placa de presión. Clásico.",
  "La caja parece normal—hasta que te guiña un ojo.",
  "Abres la caja y una bocanada de humo brillante sale, con un extraño olor a canela.",
  "El cofre gime mientras lo abres, como si no quisiera revelar sus secretos.",
  "Hay una nota clavada en la tapa: “Definitivamente no está maldito.”",
  "Un pesado cofre con refuerzos de hierro descansa en el centro de la sala, sin una mota de polvo. Demasiado limpio.",
  "Extiendes la mano hacia la tapa, pero el cofre retrocede tres pasos de golpe.",
  "Dentro de la caja de madera encuentras... otra caja más pequeña. Etiquetada cuidadosamente como “Importante”.",
  "El cofre se abre con un crujido dramático, revelando un solo calcetín. Está brillando.",
  "La caja está fuertemente cerrada, pero ves arañazos frescos alrededor de la cerradura. Alguien más lo intentó.",
  "Levantas la tapa y docenas de ojos parpadean hacia ti. Luego desaparecen.",
  "Tan pronto como abres el cofre, suena una trompeta desde la nada. ¿Demasiado dramático?",
  "Quitas el polvo de un cofre metálico—grabado con runas que se reordenan al tocarlas.",
  "No está cerrado con llave, pero hay algo en el silencio alrededor del cofre que te hace dudar.",
  "Encuentras un pequeño cofre oculto bajo una pila de huesos. Probablemente no eran humanos.",
  "Abres la tapa y encuentras... tu propio nombre tallado dentro.",
  "El cofre está vacío—pero jurarías que viste algo moverse dentro antes de abrirlo."
],
    "eny_meeting": [
  "Sientes que te observan, pero cuando giras, no hay más que sombras.",
  "Un sonido bajo y húmedo resuena en el pasillo... y se está acercando.",
  "Te congelas a mitad de paso—el silencio que te rodea es de repente *demasiado* completo.",
  "Algo se mueve justo más allá del alcance de tu antorcha.",
  "Escuchas un ruido lento y arrastrado detrás de la pared... luego silencio.",
  "Una sombra se desprende de la esquina y se mueve—contra la luz.",
  "Un leve sonido de respiración viene del frente. Se detiene en cuanto lo notas.",
  "Tu pie golpea algo suave en el suelo. Se estremece.",
  "Ves huellas frescas en el polvo—*muy* frescas.",
  "Se te eriza la piel al entrar en la cámara. No estás solo.",
  "Escuchas un único chasquido metálico. Luego otro. Luego... nada.",
  "El aire aquí es más cálido. Y huele... mal.",
  "Jurarías haber visto algo al final del pasillo—pero ahora ha desaparecido.",
  "Un siseo distante se desliza por el silencio, tan tenue que dudas si fue real.",
  "Tu antorcha parpadea dos veces—en el tercer parpadeo, hay algo donde antes no había nada.",
  "Giras una esquina y te enfrentas a—*nada*. Pero el miedo en tu estómago dice otra cosa.",
  "Un gruñido profundo resuena en las paredes. ¿O fue el techo?",
  "Un susurro roza tu oído, aunque no hay nadie. Dijo... tu nombre.",
  "El suelo frente a ti está chamuscado. Aún caliente.",
  "Parpadeas, y cuando tu visión se aclara, la habitación ha cambiado. Y ya no estás solo."
],
    "safe_room": [
  "Empujas la puerta, y una luz cálida se derrama, dorada y suave.",
  "El aroma de hierbas y madera vieja te recibe como a un viejo amigo.",
  "Musgo suave cubre el suelo, y una pequeña fuente burbujea tranquilamente en el centro de la sala.",
  "Encuentras una cámara tranquila donde el tiempo parece ralentizarse, aunque sea un poco.",
  "Velas brillan en las paredes, sus llamas sin perturbarse por el aire.",
  "Una mesa está dispuesta con pan y fruta—frescos, intactos y extrañamente acogedores.",
  "El aire es cálido, el silencio suave. Incluso tus heridas duelen un poco menos aquí.",
  "Una vieja chimenea crepita en la esquina, aunque no hay señal de quién la encendió.",
  "Entras en la sala y exhalas. No habías notado lo tenso que estabas.",
  "Una suave canción de cuna parece susurrar desde las piedras mismas.",
  "Encuentras una hamaca que se balancea suavemente, como si esperara a alguien.",
  "Una tetera descansa sobre el fuego. Comienza a silbar justo cuando llegas.",
  "Las paredes están talladas con escenas pacíficas—bosques, estrellas, un dragón dormido.",
  "Te sientas, y por primera vez en días, nada intenta matarte.",
  "Una melodía tenue y familiar suena en algún lugar de la sala—¿una de tu infancia, tal vez?",
  "Entras en la cámara, y por un breve momento, se siente como en casa.",
  "La habitación huele a lavanda y pergamino antiguo. Se siente segura.",
  "Un montón de mantas gruesas y acogedoras descansa en una esquina. Parecen absurdamente limpias.",
  "Escuchas un ronquido suave. Un gato amigable duerme sobre un montón de cojines.",
  "Hay una nota escrita a mano en la pared: “Descansa aquí, valiente viajero. Te lo has ganado.”"
],
    "magic_place": [
  "Una luz suave brilla desde el centro de la sala, donde un cristal flota a centímetros sobre un antiguo pedestal.",
  "Escuchas el suave murmullo del agua, y entras en una cámara donde una fuente luminosa fluye hacia arriba.",
  "El aire vibra levemente, lleno de un poder que sientes en los huesos.",
  "Un círculo de runas rodea una pequeña piscina de líquido plateado—su superficie completamente inmóvil.",
  "Una esfera flotante gira lentamente en el aire, proyectando reflejos de arcoíris en las paredes.",
  "Al entrar, la sala reacciona—glifos se encienden en el suelo en un ritmo lento y pulsante.",
  "Descubres un altar cubierto de enredaderas que florecen con luces al acercarte.",
  "Un espejo está solo en la sala, pero tu reflejo sonríe antes que tú.",
  "Llegas a una cámara bañada en crepúsculo, aunque aquí ningún sol podría brillar.",
  "En el centro de la sala, una espada flota, con la punta hacia abajo, incrustada en nada.",
  "Las aguas de la fuente brillan con una luz verde suave, y el aire huele a primavera.",
  "Una escalera en espiral no lleva a ningún lugar—hasta que la pisas, y comienza a moverse.",
  "Al acercarte a la piscina, peces brillantes nadan por el aire como aves.",
  "La sala está llena de libros que pasan sus páginas lentamente, como si se leyeran solos.",
  "Tocas la pared de piedra, y canta suavemente en un idioma que casi entiendes.",
  "Un rayo de luz cae de la nada, iluminando un cáliz que parece intacto por el tiempo.",
  "El aire está lleno de destellos, y al inhalar, recuerdas brevemente un sueño olvidado.",
  "Unas huellas—ligeramente brillantes—cruzan la sala y desaparecen en la pared.",
  "En el centro hay un huevo gigante, agrietado. Lo que sea que había dentro dejó un rastro de polvo estelar.",
  "Parpadeas, y toda la sala cambia de color—de azul profundo a dorado vibrante—como si reaccionara a tu presencia."
],
    "char_names": [
      "Thalwen",
      "Marjorielle",
      "Drevik",
      "Nimaé",
      "Corvinus",
      "Liora",
      "Fenric",
      "Ysilde",
      "Brambletuck",
      "Kaelen",
      "Odra the Quiet",
      "Sir Pindleworth",
      "Ériska",
      "Jorran",
      "Velka",
      "Maelis of the Dusk",
      "Tarnik",
      "Belladora",
      "Rooke",
      "Nemri",
      "Azgarn",
      "Fiolla",
      "Wendilynn",
      "Quorran",
      "Ephraim the Slightly Lost",
      "Zaliara",
      "Grimble",
      "Ansel of Greenmere",
      "Nehari",
      "Torvik Ashhand"
    ],
    "char_adjectives": [
  "Soñoliento",
  "Sangriento",
  "Misterioso",
  "Malhumorado",
  "Radiante",
  "Baboso",
  "Maldito",
  "Hablador",
  "Hambriento",
  "Furioso",
  "Gruñón",
  "Sombrío",
  "Orgulloso",
  "Húmedo",
  "Centelleante",
  "Oxidado",
  "Desdentado",
  "Llorón",
  "Elegante",
  "Risueño",
  "Podrido",
  "Ardiente",
  "Educado",
  "Ceniciento",
  "Pegajoso",
  "Afligido",
  "Sigiloso",
  "Dracónico",
  "Titilante",
  "Arrugado",
  "Adormecido",
  "Ácido",
  "Jubiloso",
  "Venenoso",
  "Andrajoso",
  "Sin parpadear",
  "Chispeante",
  "Confundido",
  "Hueco",
  "Malvado",
  "Sollozante",
  "Tímido",
  "Sonriente",
  "Marchito",
  "Antiguo",
  "Bostezante",
  "Resonante",
  "Débil",
  "Melancólico",
  "Espinoso"
],
    "equipable_items": [
  "Casco",
  "Capa",
  "Brazalete",
  "Guantes",
  "Botas",
  "Gafas",
  "Hombreras",
  "Amuleto",
  "Anillo",
  "Cinturón",
  "Bufanda",
  "Monóculo",
  "Túnica",
  "Pantalones",
  "Espaldar",
  "Capucha",
  "Máscara",
  "Manto",
  "Corsé",
  "Brazales",
  "Grebas",
  "Guantelete",
  "Collar",
  "Pantuflas",
  "Mochila",
  "Chaleco",
  "Tiara",
  "Pendientes",
  "Chal",
  "Pañuelo"
],
    "item_adjectives": [
  "Mohoso",
  "Encantado",
  "Esponjoso",
  "Maldito",
  "Brillante",
  "Húmedo",
  "Legendario",
  "Pegajoso",
  "Reluciente",
  "Roto",
  "Gritón",
  "Oxidado",
  "Celestial",
  "Plumado",
  "Luminoso",
  "Empapado",
  "Vampírico",
  "Que pica",
  "Real",
  "Prehistórico",
  "Invisible",
  "Delgadísimo",
  "Obsidiana",
  "Chillón",
  "Antiguo",
  "Maloliente",
  "Forjado en lava",
  "Embrujado",
  "Agrietado",
  "Susurrante"
],
    "eny_random_type": [
  "Goblin débil",
  "Araña",
  "Gato desdentado",
  "Perro hambriento",
  "Rana",
  "Esqueleto sin huesos"
]
  },


  "items_dict": {
  "AntiStatus.use.ok": "Ya no sufres de {self.attribut}.",
  "AntiStatus.use.no": "No hace nada porque no estás sufriendo de {self.attribut}.",
  "AntiStatus.__str__": "utilizado para curar",
  "Wearable.worn": "Equipado",
  "Wearable.notworn": "No equipado",
  "Items.__str__": "{self.name} : {self.hp} hp / {self.mana} maná / {self.att} ataque / {self.df} defensa.",
  "Eatable.name_hppot": "Poción de salud",
  "Eatable.name_hppota": "Poción de salud adaptable",
  "Eatable.name_manapot": "Poción de maná",
  "Eatable.name_manapota": "Poción de maná adaptable",
  "Eatable.name_bandc": "Pan y queso"
},
  "characters_dict": {
  "attack_target.failed": "{self.name} ataca y... falla. {enemy.name} se ríe.",
  "attack_target.atk": "{self.name} atacó e infligió {dmg} de daño.",
  "lvl_up.no": "Tienes {self.exp}/{xp_to_lvl} exp para llegar al nivel {self.lvl + 1}.",
  "lvl_up.yes": "¡Felicidades, has subido al nivel : {self.lvl} ! Ahora eres más fuerte (+ {ahp} hp, + {amana} maná, + {aatt} ataque, + {adf} defensa).",
  "player.special_attack": "Parece que no tienes ataque especial. Simplemente atacas al enemigo.",
  "player.myturn": [
    "Atacar",
    "Capacidad especial: {self.special[0]} (cuesta {self.special[1]} maná)",
    "Usar un objeto de tu inventario"
  ],
  "player.use_item": "Usas {item.name}.",
  "player.equip_wearable": "Has equipado {item.name}.",
  "Baker.definition": "Panadero : jugador con más vida y ataque. Ataque especial (cuesta 5 maná): divide el ataque del enemigo por 2, y con suerte, también la defensa.",
    "Baker.class" : "Panadero",
    "Baker.special": "Gluten poderoso",
  "AnyClass.special_attack.invoke": "Invoques a {self.special[0]}.\n",
  "AnyClass.special_attack.nomana": "No tienes suficiente maná. Qué pena, perdiste tiempo, así que le toca al enemigo...",
  "Baker.special_attack.critical": "¡Golpe crítico! El ataque y la defensa del enemigo se dividen por 2.",
  "Baker.special_attack.ok": "El ataque del enemigo se divide por 2.",
  "NaracissicPerverse.definition": "Perverso narcisista : jugador con más maná. Ataque especial (5) : inflige daño al enemigo y te cura la mitad.",
  "NaracissicPerverse.class" : "Perverso narcisista",
    "NaracissicPerverse.special": "Culpabilizador",
  "NaracissicPerverse.special_attack.ok": "El enemigo {enemy.name} perdió {dmg} de vida y tú te curaste {int(dmg/2)}.",
  "Gambler.definition": "Apostador : jugador con más suerte. Ataque especial (3) : si sale 6 o más, inflige la mitad de la vida máxima del enemigo como daño.",
  "Gambler.class" : "Apostador",
    "Gambler.special": "Rollitos de primavera",
  "Gambler.special_attack.no": "{de}... Buen intento, pero no hizo nada.",
  "Gambler.special_attack.yes": "{de} ! {enemy.name} sufre {dmg} de daño.",
  "Gambler.special_attack.atk": "{enemy.name} también perdió {atk} de ataque.",
  "Gambler.special_attack.df": "{enemy.name} también perdió {df} de defensa.",
  "Gambler.special_attack.atkdf": "{enemy.name} también perdió {atk} de ataque y {df} de defensa.",
  "Gambler.lvl_up": "También aumentas tu suerte en 1."
},
"eny_dict": {
  "Eny.definition": "solo un ",
  "Eny.__str__.strengh": "Fuerza",
  "EnyOldMan.common_name": "Viejo",
  "EnyOldMan.definition": "Un anciano molesto por tu presencia. A veces olvida cosas.",
  "EnyOldMan.myturn": "{self.name} te olvidó y no hace nada.",
  "EnyRageDog.common_name": "Perro rabioso",
  "EnyRageDog.definition": "Un perro extraño con baba blanca. Puede atacar dos veces, cuidado.",
  "EnyRageDog.myturn": "¡{self.name} muerde de nuevo!"
},
"display_dict": {
  "wait_for_input.zero": "0 para volver atrás.\n--> ",
  "display_player_turn.turn": "TU TURNO",
  "display_eny_turn.turn": "TURNO DEL ENEMIGO"
},
"rpg_exceptions_dict": {
  "LoadingError.__str__": "No pudimos cargar tu archivo. Empezarás una nueva partida.",
  "NoSavedGame.__str__": "No hay partidas guardadas en el directorio save/. Empezarás una nueva partida.",
  "ItemNotFound.__str__": "No tienes este objeto en tu inventario.",
  "ToMuchWearable.__str__": "Solo puedes llevar 5 objetos al mismo tiempo. Desequípate de algo antes.",
  "DeadCharacter.__str__.player": "Lo siento, has muerto. Heroicamente, pero aún así... estás muerto.",
  "DeadCharacter.__str__.eny": "El enemigo {self.dead.name} ha muerto. Has ganado."
},
"events_dict": {
  "eny_encounter": "{story} \n¡Es {eny.name}! \nSe puede describir como: {eny.definition} ¡Debes luchar por tu vida!",
  "eny_generator.msg_elite": "¡Un guerrero de élite se interpone en tu camino!",
  "eny_generator.msg_boss": "⚠️ Un jefe aterrador emerge de las sombras...",
  "chest.list_choices": [
    "Bueno... Prefiero dejarlo en paz",
    "¡Por supuesto que lo abro!"
  ],
  "chest.no": "Sigues adelante en el calabozo sin tocar el cofre.",
  "chest.try": "Intentas abrirlo...\n",
  "chest.trap": "Estaba atrapado. Pierdes {ply.take_damage(hp)} hp.",
  "chest.empty": "El cofre está vacío...",
  "chest.inside_1": "{it.name} estaba en el cofre. Ahora está en tu inventario.",
  "chest.inside_2": "¡Día de suerte! ¡El cofre estaba lleno de objetos! Encontraste {it.name} y {it1.name}!",
  "fire_camp.nap": "\n¿Quieres echar una siesta?",
  "fire_camp.list_choices": [
    "¿Por qué no? ¡Este lugar parece seguro!",
    "¡Nunca! No soy un niño.",
    "¡Prefiero guardar la partida!",
    "Me gustaría revisar mi inventario."
  ],
  "fire_camp.no": "Vale, vale, no hace falta gritar... puedes continuar.",
  "fire_camp.rest": "Descansaste con éxito. Te sientes mejor: {ply.hp}/{ply.maxhp} hp, {ply.mana}/{ply.maxma} maná.",
  "fire_camp.save": "Juego guardado con éxito. ¡Puedes continuar!",
  "fire_camp.error": "Lo siento, algo salió mal. Por ahora, no hay gestión de errores porque no sé qué esperar.\nEl error fue: {e}.",
  "fire_camp.wrong": "Parece que algo salió mal, así que simplemente continúas tu aventura en el calabozo."
},
"engine_dict": {
  "openning.message": "Bienvenido al maravilloso juego RPG battle patata. Vas a explorar un calabozo infinito lleno de peligros.\n¿Quieres cargar una partida o empezar una nueva?",
  "openning.list_choices": [
    "Empezar una nueva partida",
    "Cargar una partida del directorio de guardado",
    "Cargar una partida desde una ruta personalizada (proporciona la ruta completa con la extensión .json)"
  ],
  "openning.savedgame": "Aquí están las partidas guardadas disponibles. Elige una para cargar.",
  "openning.loadfile": "Introduce la ruta absoluta de tu guardado (incluyendo C:// y la extensión .json) : \n-->  ",
  "chose_player.name": "¿Cómo te llamas?\n-->  ",
  "chose_player.player": "\nHola {name}. ¿Qué tipo de jugador eres?\n",
  "load_game.exception": "Lo siento, algo salió mal. Por ahora, no hay gestión de errores porque no sé qué esperar.\nEl error fue: {e}."
},

"main_dict": {
  "start_game.welcome": "Bienvenido a nuestro calabozo, {player.name}, orgulloso {player.__class__.__name__}!",
  "start_game.end": "Este es el final del juego. Esperamos que te hayas divertido."
},
"status_dict": {
  "status.poison": "veneno",
  "status.poison.item": "antídoto",
  "status.stupidity": "estupidez",
  "status.stupidity.item": "limpia-mente",
  "status.burn": "quemadura",
  "status.burn.item": "agua",
  "status.paralized": "paralizado",
  "status.paralized.item": "agitador",
  "status.blind": "ciego",
  "status.blind.item": "ojos",
  "status.black-cat": "gato negro",
  "status.black-cat.item": "pintura blanca"
}
}