{
    "storytelling": {
        "greetings": [
            "Les lourds nuages s'amoncellent alors que tu poses le pied devant la porte du donjon oublié.",
            "Un rire démoniaque s'évanouit dans le vent alors que tu atteins la grille rouillée du château maudit.",
            "La forêt s'écarte brusquement, dévoilant l’entrée béante d’une crypte aux symboles oubliés.",
            "Tu arrives enfin devant le bunker abandonné, vestige d’expériences interdites.",
            "Une brume surnaturelle t'accueille aux abords de la tour d’obsidienne.",
            "Les corbeaux s’envolent à ton approche : la forteresse du roi fou est devant toi.",
            "Le portail dimensionnel pulse d’énergie alors que tu poses le pied sur la planète Xarak-9.",
            "Le vieux manoir grince d’un avertissement silencieux tandis que tu franchis le seuil du domaine Von Kröhl.",
            "Les légendes disaient vrai : le labyrinthe souterrain existe bel et bien. Et tu es à sa porte.",
            "Le sol tremble légèrement alors que la porte runique s’illumine à ton approche.",
            "La tour penche, défiant les lois de la physique, mais tu sais que la vérité est cachée en son sommet.",
            "Le silence est assourdissant. Devant toi, l'entrée du Temple des Mille Morts t’observe.",
            "Un panneau écrit à la main dit 'Fuis pauvre fou !'. Trop tard, tu es déjà devant la crypte.",
            "La pluie battante ruisselle sur ton armure alors que tu atteins le seuil du château d’ombres.",
            "La jungle s’écarte et dévoile un antique escalier menant aux entrailles de la terre.",
            "Le vent hurle comme un avertissement. Devant toi : la Cathédrale du Néant.",
            "Une voix robotique t’annonce : 'Accès au niveau 13 – restreint aux entités conscientes'. Tu es au bon endroit.",
            "L'ascenseur s'arrête brusquement. Portes rouillées. Couloir sombre. Le laboratoire t'attend.",
            "Même le GPS semble avoir peur : 'Zone non cartographiée'. Parfait. Tu y es.",
            "Un gouffre infini s’ouvre devant toi, traversé par un unique pont de chaînes menant au bastion perdu.",
            "Des cris inhumains résonnent de l’intérieur, mais ta mission est claire : entrer dans le donjon vivant.",
            "La poussière millénaire se lève alors que tu franchis les colonnes d’un temple oublié.",
            "Là, devant toi, une simple cabane en bois. Trop simple. Bien trop simple.",
            "Le champ de force crépite, dévoilant une brèche dans le mur du complexe alien.",
            "Un hibou te fixe longuement puis s’envole, révélant un passage secret sous la racine d’un vieux chêne.",
            "Les statues de pierre semblent suivre tes mouvements alors que tu approches du portail interdit.",
            "Tu as survécu à la carte, au guide et au traître. Devant toi : la Porte d’Énigmes.",
            "Des drones patrouillent les cieux. Il faudra être rapide pour entrer dans la citadelle orbitale.",
            "Une voix dans l’ombre murmure : 'Tu es venu... trop tard ? Ou juste à temps ?'",
            "Une vieille chanson enfantine résonne depuis le château. Mais tu sais que personne ne l’habite depuis 300 ans.",
            "Tu poses enfin les yeux sur la pyramide inversée. Le Gardien doit être encore à l’intérieur.",
            "La neige tombe sans bruit. Devant toi : le portail d’acier d’un ancien silo nucléaire.",
            "Tu tends la main. Le mur de lumière s’ouvre. Derrière, un sanctuaire technomagique interdit.",
            "L'odeur de sang, de cendres et de rouille : le donjon de fer est tout proche.",
            "Les horloges de la ville se sont toutes arrêtées. Et toi, tu ouvres la porte du clocher maudit.",
            "Le miroir ancien t’a mené ici. À travers lui, tu vois le mausolée se dessiner.",
            "Le bruit de tes pas résonne sur le métal. Une station orbitale abandonnée, enfin accessible.",
            "L’ombre du dragon passe au-dessus de toi. Son antre n’est plus très loin.",
            "La lumière ne pénètre pas cette grotte. Mais tu sais que c’est là que tout a commencé… et que tout finira."
        ],
        "ambiance": [
            "Vous entrez dans le couloir, et l’écho de vos pas semble se multiplier autour de vous.",
            "Une brise froide effleure votre nuque—il n’y a pourtant pas de vent, et vous êtes bien sous terre.",
            "Vous poussez une lourde porte—elle grince bruyamment, comme si elle se plaignait.",
            "La lumière de la torche vacille tandis que vous descendez un escalier en colimaçon taillé dans la pierre.",
            "Quelque part au loin, vous entendez de l’eau goutter. Et autre chose.",
            "Vous vous faufilez dans un passage étroit, les murs de pierre sont humides et oppressants.",
            "La poussière flotte dans l’air, épaisse et immobile depuis des siècles... jusqu’à maintenant.",
            "Vous passez sous une arche en ruine, à peine encore debout.",
            "Quelque chose file près de votre pied. Vous préférez ne pas regarder.",
            "Vous entrez dans une pièce où chaque son que vous produisez semble englouti par l’obscurité.",
            "Une douce lueur pulse depuis le mur en face—faible, rythmée, presque comme une respiration.",
            "Vous suivez une piste de symboles anciens gravés dans le sol.",
            "L’air sent la moisissure, le métal et les secrets.",
            "Vous posez le pied sur un carrelage—l’un des carreaux s’enfonce avec un clic.",
            "Un étrange bourdonnement emplit vos oreilles. Personne d’autre ne semble l’entendre.",
            "Vous avez l’impression d’avoir déjà emprunté ce couloir. Mais pourtant vous alliez tout droit, non ?",
            "Un cri lointain résonne. Humain ? Pas humain ? Mieux vaut ne pas savoir.",
            "Vous vous sentez observé. Pas par des yeux—par les murs eux-mêmes.",
            "Votre torche faiblit un instant. L’obscurité semble… vivante.",
            "Le silence ici est si dense qu’il pèse sur votre peau."
        ],
        "chest_discovery": [
            "Vous apercevez un coffre dans un coin—le couvercle légèrement entrouvert, comme s’il avait été ouvert récemment.",
            "Recouvert de toiles d’araignées et scellé par un cadenas rouillé, l’ancien coffre semble vous défier de l’ouvrir.",
            "Une petite boîte ornée repose sur un piédestal, brillant faiblement d’une lumière bleue inquiétante.",
            "Vous trouvez un coffre au trésor... posé sur une dalle de pression. Classique.",
            "La caisse semble ordinaire—jusqu’à ce qu’elle vous fasse un clin d’œil.",
            "Vous ouvrez la boîte, et un nuage de fumée scintillante en jaillit, sentant étrangement la cannelle.",
            "Le coffre gémit lorsque vous l’ouvrez, comme s’il était réticent à révéler ses secrets.",
            "Un mot est épinglé sur le couvercle : “Absolument pas maudit.”",
            "Un lourd coffre cerclé de fer repose au centre de la pièce, sans une trace de poussière. Suspect.",
            "Vous tendez la main vers le couvercle, mais le coffre recule brusquement de trois pas.",
            "À l’intérieur de la caisse en bois, vous trouvez... une autre caisse plus petite. Étiquetée soigneusement “Important”.",
            "Le coffre s’ouvre avec un grincement théâtral, révélant une seule chaussette. Elle brille.",
            "La boîte est fermée à clé, mais vous remarquez des éraflures fraîches autour de la serrure. Quelqu’un d’autre a essayé.",
            "Vous soulevez le couvercle, et des dizaines d’yeux vous regardent. Puis disparaissent.",
            "Dès que vous ouvrez le coffre, un son de trompette retentit de nulle part. Trop dramatique ?",
            "Vous dépoussiérez un coffret métallique—gravé de runes qui se réorganisent lorsque vous les touchez.",
            "Il n’est pas verrouillé, mais quelque chose dans le silence qui l’entoure vous fait hésiter.",
            "Vous trouvez un petit coffre caché sous un tas d’ossements. Ce n’étaient probablement pas des os humains.",
            "Vous ouvrez le couvercle et trouvez... votre propre nom gravé à l’intérieur.",
            "Le coffre est vide—mais vous avez clairement vu quelque chose bouger à l’intérieur avant de l’ouvrir.",
            "Un rai de lumière éclaire soudain une forme carrée dans la poussière : un coffre oublié t'attend.",
            "Tu dégages les lianes et tombes sur une boîte ancienne scellée par des chaînes rouillées.",
            "Sous les dalles fissurées, tu remarques une trappe qui dissimule un petit coffre couvert de symboles.",
            "En poussant un mur secret, tu découvres un autel sur lequel repose un écrin poussiéreux.",
            "Un mécanisme déclenche un cliquetis sec : un compartiment s’ouvre lentement, dévoilant une boîte étrange.",
            "Au fond de l’étang asséché, tu aperçois une caisse gravée dépassant du sable craquelé.",
            "Un vieux tapis effiloché dissimulait une malle encastrée dans le sol.",
            "Ta torche vacille... et dans l’ombre, une armoire scellée attire ton regard.",
            "Une stèle bascule lentement, révélant une cache poussiéreuse contenant un petit coffre en pierre.",
            "Dans le ventre du squelette d’un géant, un coffre repose, intact malgré les siècles.",
            "Tu ouvres la gueule sculptée d’une statue, et y trouves une boîte ornée de runes.",
            "Une dalle cède sous ton pas, dévoilant une cache secrète contenant un coffre cerclé de cuivre.",
            "Les vents soulèvent la toile d'une vieille tente de guerre. En dessous, une caisse au bois noirci par le temps.",
            "La poussière se soulève à peine quand tu tires le rideau d’un tombeau oublié, derrière lequel se cache un coffre.",
            "Un rayon de lune traverse la fissure du plafond et éclaire un coffret dissimulé sous les décombres.",
            "Tu remarques une bosse suspecte dans la terre fraîchement retournée. En creusant, une boîte apparaît.",
            "Un tiroir dissimulé dans un meuble ancien révèle un petit coffret soigneusement verrouillé.",
            "Un cliquetis se fait entendre quand tu poses la main sur le mur : une cache s’ouvre lentement.",
            "Un autel effondré révèle une cavité creusée dans la pierre, abritant un coffre couvert de symboles.",
            "En t’approchant du puits, tu entends un écho métallique. Une boîte est suspendue au fond par une chaîne.",
            "Au fond du sac d’un voyageur momifié, tu trouves une boîte de métal gravée d’inscriptions anciennes.",
            "Une dalle se dérobe sous ta main. À l’intérieur, une boîte au bois parfumé, intacte.",
            "En brisant un mur friable, une cavité dévoile un coffre scellé par des clous d'argent.",
            "Tu trouves un coffre coincé entre deux poutres calcinées d’un grenier oublié.",
            "Des lucioles s’éloignent quand tu ouvres la porte de pierre, révélant une boîte couverte de mousse.",
            "Un coffre, perché en équilibre sur un pilier au centre d’un gouffre, t’attire comme un aimant.",
            "Un livre ancien dissimulait un renfoncement contenant un coffret en ivoire jauni.",
            "Une malle imposante repose au centre exact d’un cercle gravé au sol.",
            "La fontaine s’assèche brusquement, laissant apparaître un coffret incrusté dans son bassin.",
            "En tirant un levier dissimulé, une section du mur pivote et laisse entrevoir une boîte poussiéreuse.",
            "Une horloge ancienne s'arrête, son balancier révèle une cache où repose un petit coffre.",
            "Une tablette gravée chute au sol, brisée net, révélant une boîte coincée dans la pierre.",
            "Le sol se craquelle sous ton pas, et dans la faille, un éclat métallique attire ton œil.",
            "Un rideau de lianes cache l’entrée d’une alcôve naturelle contenant un coffre scellé.",
            "Tu ouvres un vieux tiroir piégé et y trouves une boîte au verrou intact.",
            "Une cloche sonne dans le lointain, et dans la sacristie déserte, un coffre t’attend en silence.",
            "Tu relèves un tapis usé par le temps : une trappe en bois révèle une malle soigneusement rangée.",
            "Un autel brisé par le temps cache une boîte maintenue par de vieilles chaînes noircies.",
            "Une simple boîte en bois repose sur un coussin au centre d’un cercle de sel intact.",
            "Une dalle se soulève doucement sous ta main : un dernier souffle de magie protège encore la boîte qu’elle contient."
        ],
        "eny_meeting": [
            "Vous sentez des yeux sur vous, mais en vous retournant, il n’y a que des ombres.",
            "Un bruit sourd et humide résonne dans le couloir... et il se rapproche.",
            "Vous vous figez en plein mouvement—le silence autour de vous est soudainement *trop* complet.",
            "Quelque chose bouge juste hors de portée de votre torche.",
            "Vous entendez un bruit de traînement lent derrière le mur... puis le silence.",
            "Une ombre se détache du coin et se déplace—à contre-lumière.",
            "Un souffle léger se fait entendre devant vous. Il cesse dès que vous y prêtez attention.",
            "Votre pied frôle quelque chose de mou au sol. Ça bouge.",
            "Vous repérez des empreintes fraîches dans la poussière—*très* fraîches.",
            "Les poils de votre nuque se dressent en entrant dans la chambre. Vous n’êtes pas seul.",
            "Vous entendez un cliquetis métallique. Puis un autre. Puis... plus rien.",
            "L’air est plus chaud ici. Et il sent... mauvais.",
            "Vous auriez juré avoir vu quelque chose au bout du couloir—mais maintenant, il n’y a plus rien.",
            "Un sifflement lointain glisse dans le silence, si faible que vous doutez de l’avoir entendu.",
            "Votre torche vacille deux fois—à la troisième, quelque chose se tient là où il n’y avait rien.",
            "Vous tournez au coin et vous retrouvez face à face avec—*rien*. Mais votre estomac se serre quand même.",
            "Un grondement profond résonne dans les murs. Ou était-ce le plafond ?",
            "Un murmure vous frôle l’oreille, mais personne n’est là. Il a dit... votre nom.",
            "Le sol devant vous est brûlé. Encore chaud.",
            "Vous clignez des yeux, et quand votre vision revient, la pièce a changé. Et vous n’êtes plus seul.",
            "Un bruit sourd te parvient. Quelque chose s’approche… et ce n’est pas humain.",
            "L’air devient plus lourd. Une présence te scrute depuis l’obscurité.",
            "Ton instinct se crispe. Tu n’es plus seul dans cette pièce.",
            "Une ombre bouge, silencieuse, juste au bord de ton champ de vision.",
            "Un souffle rauque fend le silence. Il n’est pas loin.",
            "Le sol vibre légèrement… Quelque chose se lève dans le noir.",
            "Ton cœur s’emballe. Il y a autre chose ici, qui attend.",
            "Un gémissement déformé s’élève, te glaçant le sang.",
            "Une porte claque dans ton dos. Devant toi, ça remue lentement.",
            "Le froid t’envahit sans prévenir, comme si une entité venait d’entrer.",
            "Un silence trop parfait remplace les bruits ambiants. Tu n’aimes pas ça.",
            "Tes pas résonnent... mais une autre cadence se mêle à la tienne.",
            "La torche vacille sans raison. Quelque chose la trouble.",
            "Tu entends un grognement étouffé. Il vient de l'autre côté du couloir.",
            "Une odeur nauséabonde t’agresse. Quelque chose est tout près.",
            "Ta main frôle une paroi... et une autre main t'effleure en retour.",
            "Tu tends l’oreille : des griffes frottent la pierre, lentes, calculées.",
            "Un souffle chaud balaie ta nuque. Tu n’as rien vu venir.",
            "La lumière s’éteint, comme happée. Et un murmure t’appelle.",
            "Une présence t’entoure, invisible mais palpable.",
            "Le plafond grince. Il est peut-être juste au-dessus.",
            "Tu ressens une pulsation, lourde et rythmée. Elle se rapproche.",
            "Un cri bref, étouffé. Et puis plus rien. Tu sais que c’est ton tour.",
            "Le vent semble chuchoter ton nom. Mais il n’y a pas de vent ici.",
            "Une chaîne tinte doucement. Elle n’est pas seule.",
            "Tu trébuches sur un os. Il est encore chaud.",
            "Quelque chose s’éloigne à toute vitesse... puis revient brusquement.",
            "Un rire sec, grinçant, perce le silence.",
            "Tu crois voir une silhouette. Puis deux. Puis plus rien.",
            "La porte se referme d’elle-même. Une respiration résonne dans le noir.",
            "Ta vision se trouble. Une force cherche à t’envahir.",
            "L’espace semble se plier autour de toi. Comme si une volonté étrangère te jaugeait.",
            "Tu ouvres un coffre... mais ce n’est pas un coffre.",
            "Une larme coule malgré toi. Tu ne sais pas pourquoi.",
            "Tu prononces un mot interdit, et quelque chose répond.",
            "Un miroir se brise sans raison. Ton reflet reste figé.",
            "Un froid ancien glisse sous ta peau. Il t’a vu.",
            "Un hurlement sourd remonte du sol.",
            "Ta lampe ne fait plus d’ombre. Tout autour est vivant.",
            "Une voix chuchote... dans une langue que tu comprends malgré toi."
        ],
        "safe_room": [
            "Vous poussez la porte, et une lumière chaude se répand, dorée et douce.",
            "Le parfum des herbes et du bois ancien vous accueille comme un vieil ami.",
            "De la mousse douce recouvre le sol, et une petite source jaillit paisiblement au centre de la pièce.",
            "Vous trouvez une chambre calme où le temps semble ralentir, un peu.",
            "Des bougies brillent sur les murs, leurs flammes immobiles dans l’air calme.",
            "Une table est dressée avec du pain et des fruits—frais, intacts, et étrangement accueillants.",
            "L’air est chaud, le silence apaisant. Même vos blessures semblent moins douloureuses ici.",
            "Un vieux foyer crépite dans un coin, bien qu’on ne sache pas qui l’a allumé.",
            "Vous entrez dans la pièce et expirez. Vous ne vous étiez pas rendu compte de votre tension.",
            "Une berceuse douce semble vibrer depuis les pierres elles-mêmes.",
            "Vous trouvez un hamac qui se balance doucement, comme s’il attendait quelqu’un.",
            "Une bouilloire repose sur un feu. Elle commence à siffler juste à votre arrivée.",
            "Les murs sont gravés de scènes paisibles—forêts, étoiles, un dragon endormi.",
            "Vous vous asseyez, et pour la première fois depuis des jours, rien n’essaie de vous tuer.",
            "Une mélodie familière résonne quelque part dans la pièce—de votre enfance, peut-être ?",
            "Vous entrez dans la chambre, et pendant un instant, cela ressemble à chez vous.",
            "La pièce sent la lavande et le vieux parchemin. Elle semble sûre.",
            "Une pile de couvertures épaisses et douillettes repose dans un coin. Elles sont d’une propreté absurde.",
            "Vous entendez un léger ronflement. Un chat à l’air amical dort sur un tas de coussins.",
            "Un mot manuscrit est accroché au mur : “Repose-toi ici, brave voyageur. Tu l’as bien mérité.”"
        ],
        "magic_place": [
            "Une lumière douce émane du centre de la pièce, où un cristal flotte à quelques centimètres au-dessus d’un ancien piédestal.",
            "Vous entendez un léger ruissellement, et entrez dans une chambre où une fontaine lumineuse s’écoule vers le haut.",
            "L’air vibre doucement, rempli d’une énergie que vous sentez dans vos os.",
            "Un cercle de runes entoure un petit bassin de liquide argenté—sa surface est parfaitement lisse.",
            "Une sphère flottante tourne lentement dans l’air, projetant des reflets arc-en-ciel sur les murs.",
            "Dès que vous entrez, la pièce réagit—des glyphes s’allument sur le sol dans un rythme lent et pulsé.",
            "Vous découvrez un autel couvert de lianes qui fleurissent de lumières lorsque vous approchez.",
            "Un miroir se tient seul dans la pièce, mais votre reflet sourit avant vous.",
            "Vous atteignez une chambre baignée de crépuscule, bien qu’aucun soleil ne puisse briller ici.",
            "Au centre de la pièce, une épée flotte, pointe vers le bas, plantée dans... rien du tout.",
            "Les eaux de la fontaine brillent d’une lueur verte douce, et un parfum printanier emplit l’air.",
            "Un escalier en colimaçon ne mène nulle part—jusqu’à ce que vous y posiez le pied, et qu’il se mette à bouger.",
            "Alors que vous vous approchez du bassin, des poissons lumineux nagent au-dessus comme des oiseaux.",
            "La pièce est remplie de livres qui tournent lentement leurs propres pages, comme s’ils lisaient eux-mêmes.",
            "Vous touchez le mur de pierre, et il chante doucement dans une langue que vous comprenez presque.",
            "Un faisceau de lumière tombe de nulle part, illuminant un calice intact par le temps.",
            "L’air est chargé d’étincelles, et en inspirant, vous vous souvenez brièvement d’un rêve oublié.",
            "Une série d’empreintes—légèrement lumineuses—traversent la pièce et disparaissent dans le mur.",
            "Au centre repose un œuf géant, fissuré. Ce qu’il contenait a laissé une traînée de poussière d’étoiles.",
            "Vous clignez des yeux, et toute la pièce change de couleur—du bleu profond à l’or éclatant—comme si elle réagissait à votre présence."
        ],
        "char_names": [
            "Thalwen",
            "Marjorielle",
            "Drevik",
            "Nimaé",
            "Corvinus",
            "Liora",
            "Fenric",
            "Ysilde",
            "Brambletuck",
            "Kaelen",
            "Odra the Quiet",
            "Sir Pindleworth",
            "Ériska",
            "Jorran",
            "Velka",
            "Maelis of the Dusk",
            "Tarnik",
            "Belladora",
            "Rooke",
            "Nemri",
            "Azgarn",
            "Fiolla",
            "Wendilynn",
            "Quorran",
            "Ephraim the Slightly Lost",
            "Zaliara",
            "Grimble",
            "Ansel of Greenmere",
            "Nehari",
            "Torvik Ashhand"
        ],
        "char_adjectives": [
            "Endormi",
            "Sanglant",
            "Mystérieux",
            "Boudeur",
            "Rayonnant",
            "Visqueux",
            "Maudit",
            "Bavard",
            "Affamé",
            "Furieux",
            "Grincheux",
            "Ombreux",
            "Fier",
            "Humide",
            "Scintillant",
            "Rouillé",
            "Sans dents",
            "Gémissant",
            "Élégant",
            "Rieur",
            "Pourri",
            "Enflammé",
            "Poli",
            "Cendré",
            "Collant",
            "En deuil",
            "Furtif",
            "Draconique",
            "Étincelant",
            "Ridé",
            "Assoupi",
            "Aigre",
            "Joyeux",
            "Venimeux",
            "Dépenaillé",
            "Sans ciller",
            "Grésillant",
            "Perplexe",
            "Creux",
            "Maléfique",
            "Pleurant",
            "Timide",
            "Souriant",
            "Flétri",
            "Ancien",
            "Bâilleur",
            "Résonnant",
            "Frêle",
            "Mélancolique",
            "Épineux"
        ],
        "equipable_items": [
            "Casque",
            "Cape",
            "Bracelet",
            "Gants",
            "Bottes",
            "Lunettes",
            "Épaulettes",
            "Amulette",
            "Anneau",
            "Ceinture",
            "Écharpe",
            "Monocle",
            "Tunique",
            "Jambières",
            "Spallières",
            "Capuche",
            "Masque",
            "Manteau",
            "Corset",
            "Brassards",
            "Grèves",
            "Gantelet",
            "Collier",
            "Pantoufles",
            "Sac à dos",
            "Gilet",
            "Diadème",
            "Boucles d’oreilles",
            "Châle",
            "Bandeau"
        ],
        "item_adjectives": [
            "Moisi",
            "Enchanté",
            "Duveteux",
            "Maudit",
            "Scintillant",
            "Humide",
            "Légendaire",
            "Collant",
            "Chatoyant",
            "Déchiré",
            "Hurlant",
            "Rouillé",
            "Céleste",
            "Plumé",
            "Lumineux",
            "Trempé",
            "Vampirique",
            "Qui gratte",
            "Royal",
            "Préhistorique",
            "Invisible",
            "Ultra-fin",
            "Obsidienne",
            "Couinant",
            "Ancien",
            "Malodorant",
            "Forgé dans la lave",
            "Hanté",
            "Fendu",
            "Murmurant"
        ],
        "eny_random_type": [
            "Gobelin faible",
            "Araignée",
            "Chat sans dents",
            "Chien affamé",
            "Grenouille",
            "Squelette sans os"
        ]
    },
    "items_dict": {
        "AntiStatus.use.ok": "Vous ne souffrez plus de {self.attribut}.",
        "AntiStatus.use.no": "Cela ne fait rien car vous ne souffrez pas de {self.attribut}.",
        "AntiStatus.__str__": "utilisé pour soigner",
        "Wearable.worn": "Porté",
        "Wearable.notworn": "Non porté",
        "Items.__str__": "{self.name} : {self.hp} hp / {self.mana} mana / {self.att} attaque / {self.df} défense.",
        "Eatable.name_hppot": "Potion de santé",
        "Eatable.name_hppota": "Potion de santé adaptative",
        "Eatable.name_manapot": "Potion de mana",
        "Eatable.name_manapota": "Potion de mana adaptative",
        "Eatable.name_bandc": "Pain et fromage",
        "BuffingItem.__str__": "amélioration",
        "BuffingItem.use": "Vous vous sentez plus fort, et vos ennemis tremblent de terreur..."
    },
    "characters_dict": {
        "attack_target.failed": "{self.name} attaque et... Rate. {enemy.name} se marre.",
        "attack_target.atk": "{self.name} attaque et inflige {dmg} dégats.",
        "lvl_up.no": "Vous avez {self.exp}/{xp_to_lvl} xp avant le niveau {self.lvl + 1}.",
        "lvl_up.yes": "Bravo ! Vous passez niveau {self.lvl} ! Vous êtes plus fort maintenant (+ {ahp} hp, + {amana} mana, + {aatt} attaque, + {adf} défense).",
        "player.special_attack": "Il semblerait que vous n'ayez aucune capacité spéciale... Vous attaquez simplement l'ennemi. ",
        "player.myturn": [
            "Attaquer",
            "Capacité spéciale : {self.special[0]} (coût : {self.special[1]} mana)",
            "Utiliser un objet de votre inventaire"
        ],
        "player.use_item": "Vous utilisez {item.name}.",
        "player.equip_wearable": "Vous avez équipé {item.name}.",
        "Baker.definition": "Boulanger : joueur ayant plus de points de vie et d'attaque. Attaque spéciale (coût 5 mana) : divise par 2 l'attaque de l'ennemi, et avec un peu de chance, la défense aussi.",
        "Baker.class": "Boulanger",
        "Baker.special": "Gluten puissant",
        "AnyClass.special_attack.invoke": "Vous invoquez {self.special[0]}.\n",
        "AnyClass.special_attack.nomana": "Pas assez de mana. Dommage, vous avez perdu du temps, c’est donc au tour de votre ennemi...",
        "Baker.special_attack.critical": "Coup critique ! L'attaque et la défense de l'ennemi sont divisées par 2.",
        "Baker.special_attack.ok": "L'attaque de l'ennemi est divisée par 2.",
        "NarcissicPerverse.definition": "Pervers narcissique : joueur ayant plus de mana. Attaque spéciale (5) : inflige des dégâts à l’ennemi et vous soigne de la moitié.",
        "NarcissicPerverse.class": "Pervers narcissique",
        "NarcissicPerverse.special": "Culpabilisation",
        "NarcissicPerverse.special_attack.ok": "L'ennemi {enemy.name} a perdu {dmg} {hp} tandis que vous avez récupéré {int(dmg/2)}.",
        "Gambler.definition": "Parieur : joueur ayant plus de chance. Attaque spéciale (3) : si 6 ou plus, inflige la moitié des points de vie max de l’ennemi en dégâts.",
        "Gambler.class": "Parieur",
        "Gambler.special": "Nems du destin",
        "Gambler.special_attack.no": "{de}... Bien tenté mais cela ne fait rien.",
        "Gambler.special_attack.yes": "{de} ! {enemy.name} subit {dmg} dégâts.",
        "Gambler.special_attack.atk": "{enemy.name} a aussi perdu {atk} en attaque.",
        "Gambler.special_attack.df": "{enemy.name} a aussi perdu {df} en défense.",
        "Gambler.special_attack.atkdf": "{enemy.name} a aussi perdu {atk} en attaque et {df} en défense.",
        "Gambler.lvl_up": "Vous augmentez aussi votre chance de 1.",
        "character.cure_status": "{name} ne vous touche plus.",
        "character.impact_status": "Vous êtes touché par {status.name}. Cela applique {value} {effect}.",
        "player.change_wearable.no": "Vous n'avez échangé aucun équipement.",
        "player.unequip_wearable": "Vous avez retiré {item.name}."
    },
    "eny_dict": {
        "Eny.definition": "juste un ",
        "Eny.__str__.strengh": "Force",
        "EnyOldMan.common_name": "Vieil homme",
        "EnyOldMan.definition": "Un vieil homme dérangé par votre présence. Il oublie parfois des choses.",
        "EnyOldMan.myturn": "{self.name} vous a oublié et ne fait rien.",
        "EnyRageDog.common_name": "Chien enragé",
        "EnyRageDog.definition": "Un chien étrange avec de la bave blanche. Il peut attaquer deux fois, soyez prudent.",
        "EnyRageDog.myturn": "{self.name} mord à nouveau !",
        "EnyElementaryBug.common_name": "Cafard élémentaire",
        "EnyElementaryBug.definition": "Un cafard agaçant qui applique des malus selon son élément. Attention, il n'est pas si facile à tuer.",
        "EnyElementaryBug.still_alive": "Vous pensiez qu'il était écrasé. Mais il bouge encore !",
        "EnyElementaryBug.myturn": "{self.name} vous a piqué et a appliqué {self.malus[0]}.",
        "element_list": [
            "Toxique",
            "Intelligent",
            "Ardent",
            "Électrique",
            "Brillant",
            "Maudit"
        ]
    },
    "display_dict": {
        "wait_for_input.zero": "0 pour revenir en arrière.\n--> ",
        "display_player_turn.turn": "VOTRE TOUR",
        "display_eny_turn.turn": "TOUR DE L'ENNEMI"
    },
    "rpg_exceptions_dict": {
        "LoadingError.__str__": "Nous n’avons pas pu charger votre fichier. Vous allez commencer une nouvelle partie.",
        "NoSavedGame.__str__": "Aucune partie sauvegardée dans le dossier save/. Vous allez commencer une nouvelle partie.",
        "ItemNotFound.__str__": "Vous n’avez pas cet objet dans votre inventaire.",
        "ToMuchWearable.__str__": "Vous ne pouvez porter que 5 objets à la fois, veuillez en déséquiper un avant.",
        "DeadCharacter.__str__.player": "Désolé, vous êtes mort. Héroïquement, certes… mais mort.",
        "DeadCharacter.__str__.eny": "L'ennemi {self.dead.name} est mort. Vous avez gagné."
    },
    "events_dict": {
        "eny_encounter": "{story} \nC'est {eny.name} ! \nOn peut le décrire ainsi : {eny.definition} Vous devez vous battre pour survivre !",
        "eny_generator.msg_elite": "Un guerrier d'élite bloque votre chemin !",
        "eny_generator.msg_boss": "⚠️ Un boss terrifiant surgit des ombres...",
        "chest.list_choices": [
            "Bon... Je préfère le laisser tranquille",
            "Bien sûr que je l’ouvre !"
        ],
        "chest.no": "Vous continuez dans le donjon sans toucher au coffre.",
        "chest.try": "Vous essayez de l’ouvrir...\n",
        "chest.trap": "C'était piégé. Vous perdez {ply.take_damage(hp)} {hp.full}.",
        "chest.empty": "Le coffre est vide...",
        "chest.inside_1": "{it.name} était dans le coffre. Il est maintenant dans votre inventaire.",
        "chest.inside_2": "Jour de chance ! Le coffre était rempli d’objets ! Vous avez trouvé {it.name} et {it1.name} !",
        "fire_camp.nap": "\nSouhaitez-vous faire une sieste ?",
        "fire_camp.list_choices": [
            "Pourquoi pas, cet endroit semble sûr !",
            "Jamais ! Je ne suis pas un enfant.",
            "Je préfère sauvegarder la partie !",
            "J’aimerais consulter mon inventaire."
        ],
        "fire_camp.no": "Ok ok, pas besoin de crier... Vous pouvez continuer.",
        "fire_camp.rest": "Vous vous êtes reposé avec succès. Vous vous sentez mieux : {ply.hp}/{ply.maxhp} hp, {ply.mana}/{ply.maxma} mana.",
        "fire_camp.save": "Partie sauvegardée avec succès. Vous pouvez continuer !",
        "fire_camp.error": "Désolé, quelque chose a mal tourné. Pour l’instant, aucune gestion spécifique des erreurs n’a été prévue, car je ne sais pas à quoi m’attendre.\nCette erreur est : {e}.",
        "fire_camp.wrong": "Il semble qu’il y ait eu un problème, vous continuez donc simplement votre aventure dans le donjon.",
        "place_generator.place": [
            "Lampe de bénédiction",
            "Cascade guérisseuse",
            "Fumée maudite"
        ],
        "place_generator.blessing": "C'était une {name}. Elle vous donne le bonus {stat.name} pendant {duration} tours.",
        "place_generator.wrong": "Quelque chose s'est mal passé dans",
        "place_generator.cursed": "Vous toussez bruyamment. Après avoir repris vos esprits, vous vous sentez pire que jamais. Tous vos malus dureront plus longtemps que prévu.",
        "place_generator.healing": "Vous vous sentez bien mieux, comme si une magie inconnue avait soigné tous les malus dont vous souffriez.",
        "magic_places.choices": [
            "Je veux regarder de plus près",
            "Je préfère rester à l'écart de cet endroit"
        ],
        "magic_places.no": "Vous faites demi-tour et mettez autant de distance que possible entre cet endroit et vous."
    },
    "engine_dict": {
        "openning.message": "Bienvenue dans le merveilleux jeu RPG battle patata. Vous allez explorer un donjon infini rempli de dangers.\nSouhaitez-vous charger une partie ou en commencer une nouvelle ?",
        "openning.list_choices": [
            "Commencer une nouvelle partie",
            "Charger une partie depuis le dossier de sauvegarde",
            "Charger une partie depuis un chemin personnalisé (veuillez fournir le chemin complet avec l'extension .json)"
        ],
        "openning.savedgame": "Voici les parties sauvegardées disponibles. Veuillez en choisir une à charger.",
        "openning.loadfile": "Entrez le chemin absolu vers votre sauvegarde (y compris C:// et l’extension .json) : \n-->  ",
        "chose_player.name": "Quel est votre nom ?\n-->  ",
        "chose_player.player": "\nBonjour {name}. Quel type de joueur êtes-vous ?\n",
        "load_game.exception": "Désolé, quelque chose a mal tourné. Pour l’instant, aucune gestion spécifique des erreurs n’a été prévue, car je ne sais pas à quoi m’attendre.\nCette erreur est : {e}."
    },
    "main_dict": {
        "start_game.welcome": "Bienvenue dans notre donjon, {player.name}, fier {player.__class__.__name__} !",
        "start_game.end": "C'est la fin du jeu. Nous espérons que vous vous êtes amusé."
    },
    "status_dict": {
        "status.malus.poison": "poison",
        "status.item.poison": "antidote",
        "status.malus.stupidity": "stupidité",
        "status.item.stupidity": "aspire-esprit",
        "status.malus.burn": "brûlure",
        "status.item.burn": "eau",
        "status.malus.paralized": "paralysé",
        "status.item.paralized": "secoueur",
        "status.malus.blind": "aveugle",
        "status.item.blind": "yeux",
        "status.malus.black-cat": "chat noir",
        "status.item.black-cat": "peinture blanche",
        "status.strengh.slight": "léger",
        "status.strengh.serious": "sérieux",
        "status.bonus.cuckold": "cocu",
        "status.item.cuckold": "ticket de loto gagnant",
        "status.bonus.love": "amoureux",
        "status.item.love": "filtre d'amour",
        "status.bonus.anger": "colère",
        "status.item.anger": "cape rouge",
        "status.bonus.stone": "abdos en béton",
        "status.item.stone": "abonnement à la salle de sport",
        "status.bonus.wikipedia": "Monsieur Wikipédia",
        "status.item.wikipedia": "connexion WiFi"
    },
    "webapp_dict": {
        "char_selection.who": "Fier explorateur -ou peut être fou, qui es-tu ?",
        "char_selection.chose_class": "Quelle genre de personne es-tu ?",
        "char_selection.name": "Quel est ton nom ?",
        "char_selection.start" : "Commencer l'exploration !",
        "resolve_chest_event.open": "Veux-tu l'ouvrir ?",
        "base.about": "A propos",
        "base.close": "Quitter",
        "index.startgame": "Je veux me battre !!!",
        "inventory.inventory": "Inventaire",
        "game.lvl": "de niveau",
        "game.attack": "Attaque",
        "game.special": "Capacité spéciale",
        "game.enemy_turn": "L'ennemi attaque !",
        "game.continue": "Continuer à explorer le donjon",
        "game.dead": "Je veux réessayer !",
        "chest.open": "Bien sûr que je l'ouvre !",
        "chest.no": "Eh bien... je préfère partir.",
        "equipment.inventory": "Dans l'inventaire",
        "equipment.equipment": "Équipement",
        "equipment.equipment.equip": "Équiper",
        "equipment.equipment.unequip": "Retirer",
        "equipment.worn": "Equipé",
        "equipment.worn.max": "Vous ne pouvez porter que 5 objets à la fois. Retirez-en un si vous voulez en équiper un autre :",
        "index.greetings" : "Tu ouvres les yeux dans une clairière brumeuse, au cœur d’un monde que tu ne reconnais pas.\nDes murmures étranges t'entourent, des ombres se déplacent dans les bois, et l’air est chargé de magie et de menace.\nOn dit que ce territoire, autrefois fertile, est désormais le théâtre d’affrontements entre héros déchus, bêtes féroces et patatas… enragées.\nTon but ? Survivre. Te battre. Devenir plus fort à chaque combat.\nEt peut-être, un jour, découvrir pourquoi toi, parmi tous, as été invoqué ici.\nMais pour l’instant, l’heure n’est pas aux questions.\nIl te faut un corps, un nom, et une classe. Prépare-toi, aventurier. L’histoire commence maintenant."
    },
    "about_dict" : {
        "about.introduction" : "L'idée de ce projet était simplement de me permettre d'apprendre la programmation en m'amusant.\nIl n'a aucune prétention à être autre chose qu'un projet d'étudiant (certes en auto-apprentissage, mais étudiant quand même).",
        "about.story" : "Tout commence fin mars 2025, alors que je voulais m'exercer à la programmation orientée objet, dont je ne voyais alors pas l'intérêt (j'ai depuis largement changé d'avis). \nJ'ai donc commencé par développer un petit RPG simple en lignes de commande (utilisant la console windows, cette petite fenêtre toute noire avec du texte écrit en blanc) permettant à un joueur de combattre un enemi, à l'infini.\nChaque fois que j'ai atteint un stade qui m'a paru très satisfaisant (aucun bug, et dont l'action réalisée correspondait à l'action que je VOULAIS réaliser, ce qui n'est pas toujours le cas...), j'ai montré mon code à mon collègue un peu relou. Vous savez, celui qui n'est jamais là et qui se pointe la gueule enfarinée à la fin du projet, pour dire quelque chose d'insupportable du genre 'Je n'aurais pas fait ça comme ça' ou 'Pourquoi ne l'as-tu pas fait comme ça' ou encore 'C'est pas mal MAIS ...'. Bref, ce collègue a été parfaitment incarné par ChatGPT. \nAinsi, à chaque nouvelle réalisation que je trouvais incroyable, trop cool et dont j'étais très fière, j'ai été challengée par ces fichus 'neurones artificiels', qui me proposaient chaque fois plusieurs améliorations que je pourrais effectuer.\n",
        "about.learn" : "Entre une chose et une autre, j'ai appris à :\n- développer un RPG roguelike en lignes de commande (programmation orientée objet)\n- demander à l'utilisateur certaines informations (gestion des entrées et vérification des données saisies)\n- générer aléatoirement des événements (gestion de l'aléatoire et utilisation des tables d'événement)\n- gagner des objets et pouvoir les utiliser (programmation orientée objet et prise de tête dans la gestion des imports)\n- sauvegarder et charger la progression du joueur (gestion des fichiers externes)\n- modulariser le code et créer un package python\n- découverte de GitHub et partage opensource\n- amélioration de la modularité en séparant l'affichage du moteur de jeu\n- support multilangue (grâce au point précédent)\n- apprendre à mettre en place un debug efficace (utilisation de tests unitaires)\n...\n\nFin avril, j'étais alors très contente du résultat de mon super jeu en lignes de commande.\nMais force est de constater que personne n'était super chaud pour le tester et 's'amuser' avec, puisqu'il était très moche et 'compliqué' à déployer. (personne n'a envie de télécharger un repo github, installer les dépendances, lancer la console windows, taper des commandes pour finalement jouer à un jeu pourri et moche sur cette même console)\n\nDonc, j'ai également dû apprendre à :\n- créer une application web (tournant sur un serveur local)\n- m'assurer de la cross-compatibilité de l'app web et l'app en lignes de commande (je voulais que les 2 soient utilisables et donc que l'app web ne 'casse' pas l'app console)\n- déployer une application web sur un serveur web afin de pouvoir y accéder via internet\net vous êtes ici.\n",
        "about.ia" : "/!\\ l'utilisation de l'IA (chatGPT) a été fréquente sur ce projet : comme collègue relou ('tu devrais/pourrais faire ça'), comme aide au débug, mais également :\n- pour générer les phrases d'ambiance (découverte de lieux, d'ennemis...), les noms, les adjectifs, bref une grosse partie des textes affichés\n- pour traduire ces textes de l'anglais vers le français et l'espagnol \n- pour générer les quelques images du projet",
        "about.bugs" : "- si vous essayez de changer de langue durant un combat contre le cafard élémentaire, cela génèrera une erreur. Je crois que cela vient du fait que l'application des malus se base sur le nom du malus, et comme le nom du malus déjà appliqué ne se met pas à jour lors du changement de langue, ça fait un bug (car il cherche un malus en français alors que celui appliqué est en anglais par exemple). Mais pour le moment j'ai eu la FLEMME de chercher comment corriger ça.\n- le texte en français est foireux : il tutoie/vouvoie sans cohérence et parfois dans la même phrase. A l'origine, le texte était en anglais donc il n'y avait pas ce problème, et comme je l'ai fait traduire par IA sans repasser derrière, ça fait parfois des choses étonnantes (flemme)\n- le genre des noms en français n'est pas toujours respecté (flemme)\n- le nom des objets et des monstres est parfois surprenant car l'adjectif et le nom sont inversés. Le moteur qui génère aléatoirement le nom à partir d'un nom et d'un adjectif aléatoires a été pensé pour un texte en anglais (flemme)\n- il y a sûrement ces mêmes soucis en espagnol, mais je ne parle pas espagnol donc je suis incapable de les identifier (flemme)\n",
        "about.roadmap" : "Même si je me dis souvent que ça ne sert à rien de chercher à faire un jeu vraiment jouable et compliqué, j'ai quand même pas mal d'idées d'améliorations :\n- créer une page de classement afin d'avoir une sorte de compétition entre les joueurs (nécessite de déployer et gérer une base de données)\n- créer une formulaire de contact permettant de laisser un commentaire ou faire remonter un bug (base de données)\n- rendre le site 'responsive', permettant un affichage fluide quelque soit la taille de l'écran (téléphone/tablette/ordi)\n- toute bêtement ajouter du contenu (personnages jouables, ennemis, attaques/sorts)\n- on pourrait même essayer de faire une sorte de 'cartographie' du donjon et de se déplacer dans les différents endroits\n- bref ; les possibilités sont infinies, mais fortement limitées par le temps et surtout la FLEMME\n",
        "about.github" : "Vous pouvez retrouver l'intégralité du code utilisé (back et front-end) sur ma page GitHub : \n",
        "about.learn.title" : "Compétences développées",
        "about.ia.title" : "Utilisation de l'IA",
        "about.bugs.title" : "Bugs connus",
        "about.roadmap.title" : "Quelle est la suite ?",
        "about.github.title" : "GitHub",
        "about.story.title" : "Développement du projet, storytelling et blabla(s)(s)(s)"
    },
  "stats_dict" : {
    "hp" : "PV",
    "mana" : "MANA",
    "att" : "ATT",
    "df" : "DEF",
    "luck" : "CHA",
    "maxhp" : "max PV",
    "maxma" : "max MANA",
    "hp.full" : "points de vie",
    "mana.full" : "points de mana",
    "att.full" : "attaque",
    "df.full" : "defense",
    "luck.full" : "chance",
    "maxhp.full" : "maximum points de vie",
    "maxma.full" : "maximum points de mana"
  }
}